docs/examples/EnviarLoteRps-Valido.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <ns2:RecepcionarLoteRps xmlns:ns2="http://www.sped.fazenda.gov.br/nfse">
         <nfseCabecMsg>
            <cabecalho versao="1.00" xmlns="http://www.sped.fazenda.gov.br/nfse">
               <versaoDados>1.00</versaoDados>
            </cabecalho>
         </nfseCabecMsg>
         <nfseDadosMsg>
            <EnviarLoteRpsEnvio xmlns="https://www.issnetonline.com.br/webservicenfse/vsd/servico_enviar_lote_rps_envio.xsd" xmlns:tc="https://www.issnetonline.com.br/webservicenfse/vsd/tipos_complexos.xsd">
               <LoteRps Id="lote">
                  <!--Número do Lote de RPS. Ocorrência 1-1. Numérico de tamanho máximo 15-->
                  <NumeroLote>?</NumeroLote>
                  <!--CNPJ ou CPF do prestador/ Inscrição municipal do prestador. Ocorrência 1-1.-->
                  <CpfCnpj>
                     <!--CPF ou CNPJ da empresa/pessoa. Não enviar ambas as tags.-->
                     <Cnpj>?</Cnpj>
                     <Cpf>?</Cpf>
                  </CpfCnpj>
                  <!--Número de inscrição municipal. Numérico de tamanho máximo 15.-->
                  <InscricaoMunicipal>?</InscricaoMunicipal>
                  <!--Quantidade de RPS do Lote. Numérico de tamanho máximo 4.-->
                  <QuantidadeRps>?</QuantidadeRps>
                  <!--Dados dos RPSs. Ocorrência 1-N.-->
                  <ListaRps>
                     <Rps>
                        <InfDeclaracaoPrestacaoServico>
                           <!--Representa dados informativos do Recibo Provisório de Serviço (RPS)-->
                           <Rps>
                              <IdentificacaoRps>
                                 <!--Número do RPS-->
                                 <Numero>?</Numero>
                                 <!--Série do RPS-->
                                 <Serie>?</Serie>
                                 <!--Tipo do RPS informar 1 – Recibo Provisório de Serviços;-->
                                 <Tipo>1</Tipo>
                              </IdentificacaoRps>
                              <!--Data de emissão do RPS. Formato:(AAAA-MM-DD)-->
                              <DataEmissao>?</DataEmissao>
                              <!--Situação do RPS (1 – Normal ou 2 – Cancelado)-->
                              <Status>?</Status>
                              <!--IDENTIFICAÇÃO DO RPS SUBSTITUÍDO (OPCIONAL)-->
                              <RpsSubstituido>
                                 <!--Número do RPS-->
                                 <Numero>?</Numero>
                                 <!--Série do RPS-->
                                 <Serie>?</Serie>
                                 <!--Tipo do RPS informar 1 – Recibo Provisório de Serviços;-->
                                 <Tipo>1</Tipo>
                              </RpsSubstituido>
                           </Rps>
                           <!--Dia, mês e ano da prestação de serviço. Formato: (AAAA-MM-DD)-->
                           <Competencia>?</Competencia>
                           <Servico>
                              <Valores>
                                 <!--Valor dos serviços em R$-->
                                 <ValorServicos>?</ValorServicos>
                                 <!--Valor das deduções para Redução da Base de Cálculo em R$-->
                                 <ValorDeducoes>?</ValorDeducoes>
                                 <!--Valor da retenção do PIS em R$ Informação declaratória-->
                                 <ValorPis>?</ValorPis>
                                 <!--Valor da retenção do COFINS em R$ Informação declaratória-->
                                 <ValorCofins>?</ValorCofins>
                                 <!--Valor da retenção do INSS em R$ Informação declaratória-->
                                 <ValorInss>?</ValorInss>
                                 <!--Valor da retenção do IR em R$ Informação declaratória-->
                                 <ValorIr>?</ValorIr>
                                 <!--Valor da retenção do CSLL em R$ Informação declaratória-->
                                 <ValorCsll>?</ValorCsll>
                                 <!--Outras retenções na Fonte. Informação declaratória-->
                                 <OutrasRetencoes>?</OutrasRetencoes>
                                 <!--Valor total aproximado dos tributos federais, estaduais e municipais, em conformidade com o artigo 1o da Lei no 12.741/2012-->
                                 <ValTotTributos>?</ValTotTributos>
                                 <!--Valor do ISS devido em R$-->
                                 <ValorIss>?</ValorIss>
                                 <!--Alíquota do serviço prestado-->
                                 <Aliquota>?</Aliquota>
                                 <!--Valor do desconto incondicionado-->
                                 <DescontoIncondicionado>?</DescontoIncondicionado>
                                 <!--Valor do desconto condicionado-->
                                 <DescontoCondicionado>?</DescontoCondicionado>
                              </Valores>
                              <!--ISS é retido na fonte
							1 – Sim;
							2 – Não.-->
                              <IssRetido>?</IssRetido>
                              <!--Informado somente se IssRetido igual a "1 – Sim".
							A opção "2 – Intermediário" somente poderá ser selecionada se "CpfCnpjIntermediario" informado.
							1 – Tomador;
							2 – Intermediário.-->
                              <ResponsavelRetencao>?</ResponsavelRetencao>
                              <!--Subitem do serviço prestado conforme LC 116/2003-->
                              <ItemListaServico>?</ItemListaServico>
                              <!--Código CNAE-->
                              <CodigoCnae>?</CodigoCnae>
                              <!--Código do serviço prestado próprio do município-->
                              <CodigoTributacaoMunicipio>?</CodigoTributacaoMunicipio>
                              <!--CodigoNbs-->
                              <CodigoNbs>?</CodigoNbs>
                              <!--Discriminação dos serviços.-->
                              <Discriminacao>?</Discriminacao>
                              <!--Código do município onde o serviço foi prestado (tabela do IBGE), se exterior colocar 9999999-->
                              <CodigoMunicipio>?</CodigoMunicipio>
                              <!--Código do país onde o serviço foi prestado (Tabela de país do IBGE). Preencher somente se MunicipioPrestacaoServico igual 9999999-->
                              <CodigoPais>?</CodigoPais>
                              <!--Exigibilidades possíveis
							1 – Exigível;
							2 – Não incidência;
							3 – Isenção;
							4 – Exportação;
							5 – Imunidade;
							6 – Exigibilidade Suspensa por Decisão Judicial;
							7 – Exigibilidade Suspensa por Processo Administrativo.-->
                              <ExigibilidadeISS>?</ExigibilidadeISS>
                              <!--Identificação da não exigibilidade do ISSQN – somente para os casos de benefício fiscal-->
                              <IdentifNaoExigibilidade>?</IdentifNaoExigibilidade>
                              <!--Código do município onde é a incidência do imposto (Tabela do IBGE)-->
                              <MunicipioIncidencia>?</MunicipioIncidencia>
                              <!--Número do processo da suspensão da exigibilidade-->
                              <NumeroProcesso>?</NumeroProcesso>
                           </Servico>
                           <!--Identificação do prestador do serviço-->
                           <Prestador>
                              <CpfCnpj>
                                 <!--CPF ou CNPJ da empresa/pessoa. Não enviar ambas as tags.-->
                                 <Cnpj>?</Cnpj>
                                 <Cpf>?</Cpf>
                              </CpfCnpj>
                              <!--Número de inscrição municipal do prestador de serviço. Numérico de tamanho máximo 15.-->
                              <InscricaoMunicipal>?</InscricaoMunicipal>
                           </Prestador>
                           <!--Dados do tomador do serviço-->
                           <TomadorServico>
                              <IdentificacaoTomador>
                                 <CpfCnpj>
                                    <!--CPF ou CNPJ da empresa/pessoa. Não enviar ambas as tags.-->
                                    <Cnpj>?</Cnpj>
                                    <Cpf>?</Cpf>
                                 </CpfCnpj>
                                 <!--Número de inscrição municipal do tomador de serviço. Numérico de tamanho máximo 15.-->
                                 <InscricaoMunicipal>?</InscricaoMunicipal>
                              </IdentificacaoTomador>
                              <!--Este elemento só deverá ser preenchido para tomadores não residentes no Brasil-->
                              <NifTomador>?</NifTomador>
                              <!--Nome / Razão Social do tomador.-->
                              <RazaoSocial>?</RazaoSocial>
                              <!--Informar apenas uma das Tags. Ou tag Endereco ou Tag EnderecoExterior.-->
                              <!--Endereço de tomador de serviços do Brasil-->
                              <Endereco>
                                 <!--Tipo e nome do logradouro do tomador do serviço-->
                                 <Endereco>?</Endereco>
                                 <!--Número do imóvel do tomador do serviço-->
                                 <Numero>?</Numero>
                                 <!--Complemento do endereço do tomador do serviço (Opcional)-->
                                 <Complemento>?</Complemento>
                                 <!--Bairro do tomador do serviço-->
                                 <Bairro>?</Bairro>
                                 <!--Código do município do tomador do serviço (Tabela do IBGE)-->
                                 <CodigoMunicipio>?</CodigoMunicipio>
                                 <!--Sigla da unidade da federação do tomador do serviço-->
                                 <Uf>?</Uf>
                                 <!--Número do CEP do tomador do serviço-->
                                 <Cep>?</Cep>
                              </Endereco>
                              <!--Endereço de tomador de serviços do exterior-->
                              <EnderecoExterior>
                                 <!--Código do país do tomador do serviço (Tabela do de país do IBGE).-->
                                 <CodigoPais>?</CodigoPais>
                                 <!--Descrição completa do endereço do exterior-->
                                 <EnderecoCompletoExterior>?</EnderecoCompletoExterior>
                              </EnderecoExterior>
                              <!--Opcional-->
                              <Contato>
                                 <!--Número do telefone do tomador (Opcional)-->
                                 <Telefone>?</Telefone>
                                 <!--E-mail do tomador (Opcional)-->
                                 <Email>?</Email>
                              </Contato>
                           </TomadorServico>
                           <!--Tipos de Regimes especiais:
						1 – Microempresa Municipal;
						2 – Estimativa;
						3 – Sociedade de Profissionais;
						4 – Cooperativa;
						5 – Microempresário Individual (MEI);
						6 – Microempresa ou Empresa de Pequeno Porte (ME EPP).-->
                           <RegimeEspecialTributacao>?</RegimeEspecialTributacao>
                           <!--Prestador é optante pelo Simples Nacional: 
						1 – Sim;
						2 – Não .-->
                           <OptanteSimplesNacional>?</OptanteSimplesNacional>
                           <!--Prestador possui Incentivo Fiscal:
						1 – Sim;
						2 – Não.-->
                           <IncentivoFiscal>?</IncentivoFiscal>
                           <!--Opcional-->
                           <InformacoesComplementares>?</InformacoesComplementares>
                           <Deducao>
                              <!--Identificação da dedução
							1 – Materiais;
							2 – Subempreitada de mão de obra;
							3 – Serviços;
							4 – Produção externa;
							5 – Alimentação e bebidas/frigobar;
							6 – Reembolso de despesas;
							7 – Repasse consorciado;
							8 – Repasse plano de saúde
							99 – Outras deduções-->
                              <TipoDeducao>?</TipoDeducao>
                              <!--Informar o tipo da dedução no caso da opção 99 – Outras Deduções-->
                              <DescricaoDeducao>?</DescricaoDeducao>
                              <IdentificacaoDocumentoDeducao>
                                 <IdentificacaoNfse>
                                    <!--Município de geração da NFS-e-->
                                    <CodigoMunicipioGerador/>
                                    <!--Número da NFS-e-->
                                    <NumeroNfse/>
                                    <!--Código de verificação da NFS-e-->
                                    <CodigoVerificacao/>
                                 </IdentificacaoNfse>
                                 <IdentificacaoNFe>
                                    <!--Número da NF-e-->
                                    <NumeroNfe/>
                                    <!--Estado de geração da NF-e-->
                                    <UfNfe/>
                                    <!--Chave da NF-e-->
                                    <ChaveAcessoNfe/>
                                 </IdentificacaoNFe>
                                 <OutroDocumento>
                                    <!--Identificação de documento diferente de NFS-e e NF-e-->
                                    <IdentificacaoDocumento/>
                                 </OutroDocumento>
                              </IdentificacaoDocumentoDeducao>
                              <DadosFornecedor>
                                 <IdentificacaoFornecedor>
                                    >
                                    <!--CNPJ ou CPF do fornecedor do Brasil.-->
                                    <CpfCnpj>?</CpfCnpj>
                                 </IdentificacaoFornecedor>
                                 <FornecedorExterior>
                                    <!--NIF do fornecedor do exterior-->
                                    <NifFornecedor>?</NifFornecedor>
                                    <!--Código do país do fornecedor do exterior-->
                                    <CodigoPais>?</CodigoPais>
                                 </FornecedorExterior>
                              </DadosFornecedor>
                              <!--Data de Emissão do Documento Fiscal-->
                              <DataEmissao>?</DataEmissao>
                              <!--Valor dedutível do documento fiscal-->
                              <ValorDedutivel>?</ValorDedutivel>
                              <!--Valor utilizado na dedução da NFS-e. Deve ser menor ou igual ao ValorDedutivel.-->
                              <ValorUtilizadoDeducao>?</ValorUtilizadoDeducao>
                           </Deducao>
                        </InfDeclaracaoPrestacaoServico>
                     </Rps>
                  </ListaRps>
               </LoteRps>
               <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                  <SignedInfo>
                     <CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
                     <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                     <Reference URI="#rps:2ABCDZ">
                        <Transforms>
                           <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>pcpHZUpTtAfjwEVpnBW5qzDTHtc=</DigestValue>
                     </Reference>
                  </SignedInfo>
                  <SignatureValue>lunW4H0coMPXsBK/+eMkivq6IaEbtkHNRjNQrcZ/pB1Q+SzQK4/MNU+Ohbd3qk+AZKEF1L2Hr5tM
										xYqzbZpSxiSZx4+Iu5WK6E2g4o60UYPPhmrEliaY6m1KC1w+7S1a67brTgikXHQQ7QKTR32WxMyO
										TFfLYofoJRfALGFg91s=</SignatureValue>
                  <KeyInfo>
                     <X509Data>
                        <X509Certificate>MIIE7DCCA9SgAwIBAgIQZMlLC9ZEsHWsnvJNdMI2yzANBgkqhkiG9w0BAQUFADBqMQswCQYDVQQG
												EwJCUjETMBEGA1UEChMKSUNQLUJyYXNpbDEsMCoGA1UECxMjU2VjcmV0YXJpYSBkYSBSZWNlaXRh
												IEZlZGVyYWwgLSBTUkYxGDAWBgNVBAMTD0FDIFBST0RFTUdFIFNSRjAeFw0wNzEwMzEwMDAwMDBa
												Fw0xMDEwMzAyMzU5NTlaMIGQMQswCQYDVQQGEwJCUjETMBEGA1UEChQKSUNQLUJyYXNpbDEqMCgG
												A1UECxQhU2VjcmV0YXJpYSBkYSBSZWNlaXRhIEZlZGVyYWwtU1JGMRIwEAYDVQQLFAlTUkYgZS1D
												UEYxLDAqBgNVBAMTI0VER0FSIERPIENBUk1PIEZFUlJFSVJBOjQzMjYwMTUyNjg3MIGfMA0GCSqG
												SIb3DQEBAQUAA4GNADCBiQKBgQC6M+9XT5KLQN3IH8mAr+S6vxiochY/EwF8EhtNoxPTYl+zr0Dh
												+eZsRG31bN410nr2OrwncrRorMK8Ngq+j3FnNF0nIMigaaa5NAEfIk3Yy4kuqrTUZBpqUJvCqc3m
												kF3C3XD0MTmtbVTWCvYIk+qn3t5ShHyMnQcuah5Q0ItSbQIDAQABo4IB6TCCAeUwgZUGA1UdEQSB
												jTCBiqA9BgVgTAEDAaA0BDIyMTAzMTk2NDQzMjYwMTUyNjg3MDAwMDAwMDAwMDAwMDAwMDBNLTI4
												ODQwODVTU1BNR6AXBgVgTAEDBqAOBAwwMDAwMDAwMDAwMDCgHgYFYEwBAwWgFQQTMDAwMDAwMDAw
												MDAwMDAwMDAwMIEQZWRnYXJAcGJoLmdvdi5icjAJBgNVHRMEAjAAMF8GA1UdHwRYMFYwVKBSoFCG
												Tmh0dHA6Ly9pY3AtYnJhc2lsLmNlcnRpc2lnbi5jb20uYnIvcmVwb3NpdG9yaW8vbGNyL0FDUFJP
												REVNR0VTUkYvTGF0ZXN0Q1JMLmNybDAfBgNVHSMEGDAWgBTdO9vtjZcRRUMBQ020Ev0O7niacDAO
												BgNVHQ8BAf8EBAMCBeAwVQYDVR0gBE4wTDBKBgZgTAECAxQwQDA+BggrBgEFBQcCARYyaHR0cDov
												L2ljcC1icmFzaWwuY2VydGlzaWduLmNvbS5ici9yZXBvc2l0b3Jpby9kcGMwHQYDVR0lBBYwFAYI
												KwYBBQUHAwQGCCsGAQUFBwMCMDgGCCsGAQUFBwEBBCwwKjAoBggrBgEFBQcwAYYcaHR0cDovL29j
												c3AuY2VydGlzaWduLmNvbS5icjANBgkqhkiG9w0BAQUFAAOCAQEAYFcjZj4lGVEREHBaHtcRletW
												S6/mvpkxmodwj3ele5yXsxuqSZd7ebHbKewXx7gkyaWFkFAxFanQhls2tYKjg6haqt2b0AO1Fsit
												VIHkMcxRwkU9G+1ec8yfdxymra2VdXazkxuvqKABgxkqKnaFdHjje7cjWDgwparymH64mTlHkSQz
												59GutJW0xfwBHcMGx0/9/iIug6pfMQivWf0NMVpFNzxO5ZNPEuOeBhVDxQr4+KB+4B9xDai/3J6f
												42UNbSy+z3xuB0K8/7V7BsFUYOYFSNnBrXhvbvXtZOtteX65V0r1+RJJX5OK+PAPhZ57T1LEmHMg
												gdo5kli3Nr1KFQ==</X509Certificate>
                     </X509Data>
                  </KeyInfo>
               </Signature>
            </EnviarLoteRpsEnvio>
         </nfseDadosMsg>
      </ns2:RecepcionarLoteRps>
   </S:Body>
</S:Envelope>